Картотека1/src/Catalogs/трс_СвидетельствоНаПравоСобственности/трс_СвидетельствоНаПравоСобственности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>трс_СвидетельствоНаПравоСобственности</name>
  <attributes>
    <name>ВидПрава</name>
    <type>
      <types>EnumRef.трс_ВидПрава</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНедвижимости</name>
    <type>
      <types>EnumRef.трс_ТипНедвижимости</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмерениеПлощади</name>
    <type>
      <types>EnumRef.трс_ИзмерениеПлощади</types>
    </type>
  </attributes>
  <attributes>
    <name>Площадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Этажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредКадастровыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КадастроваяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъекта</name>
    <type>
      <types>EnumRef.трс_ВидОбъекта</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦелевоеИспользование</name>
    <type>
      <types>EnumRef.трс_ВидЦелевогоИспользованияЗдания</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.трс_ВидНазначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеЗдания</name>
    <type>
      <types>EnumRef.трс_ВидИспользованияЗдания</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗемель</name>
    <type>
      <types>EnumRef.трс_ВидКатегорииЗемель</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловныйКадастровыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГосРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГосРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОбъектаНедвижимости</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Правообладатель</name>
    <type>
      <types>CatalogRef.трс_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КадастровыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКадастровогоКвартала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрисвоенияКадастровогоНомера</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущийКадастровыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецАренды</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРазрешенногоИспользования</name>
    <type>
      <types>CatalogRef.трс_ВидыРазрешенногоИспользования</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодЗавершенияСтроительства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>CatalogRef.трс_ДоговорЗалога</types>
        <types>CatalogRef.трс_СитуационныйПлан</types>
        <types>CatalogRef.трс_ДоговорАренды</types>
        <types>CatalogRef.трс_АктПриемаПередачи</types>
        <types>CatalogRef.трс_ПисьмоОрганов</types>
        <types>CatalogRef.трс_ТехническийПлан</types>
        <types>CatalogRef.трс_РазрешениеНаСтроительство</types>
        <types>CatalogRef.трс_СхемаРазмещения</types>
        <types>CatalogRef.трс_Декларация</types>
        <types>CatalogRef.трс_ФайловыйДокумент</types>
        <types>CatalogRef.трс_СправкаОКадастровойСтоимости</types>
        <types>CatalogRef.трс_Справка</types>
        <types>CatalogRef.трс_УведомлениеОЗавершенииСтроительства</types>
        <types>CatalogRef.трс_КадастровыйПаспорт</types>
        <types>CatalogRef.трс_СвидетельствоНаПравоСобственности</types>
        <types>CatalogRef.трс_УведомлениеОНачалеСтроительства</types>
        <types>CatalogRef.трс_СвидетельствоОНаследстве</types>
        <types>CatalogRef.трс_РазрешениеНаВводВЭксплуатацию</types>
        <types>CatalogRef.трс_РешениеСобственникаОРазделе</types>
        <types>CatalogRef.трс_ТехническийПаспорт</types>
        <types>CatalogRef.трс_ВыпискаИзИСОГД</types>
        <types>CatalogRef.трс_ПроектРеконструкции</types>
        <types>CatalogRef.трс_МежевойПлан</types>
        <types>CatalogRef.трс_ДополнительноеСоглашение</types>
        <types>CatalogRef.трс_СоглашенияОбУступкеПрав</types>
        <types>CatalogRef.трс_ДоговорДолевогоУчастия</types>
        <types>CatalogRef.трс_ДоговорДарения</types>
        <types>CatalogRef.трс_ТехническоеЗаключение</types>
        <types>CatalogRef.трс_ДоговорМены</types>
        <types>CatalogRef.трс_ДоговорСубаренды</types>
        <types>CatalogRef.трс_ПостановлениеОПредоставленииЗемельногоУчастка</types>
        <types>CatalogRef.трс_ДоговорКуплиПродажи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Картотека1/src/Enums/трс_ТипНедвижимости/трс_ТипНедвижимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>трс_ТипНедвижимости</name>
  <enumValues>
    <name>ОбъектКапитальногоСтроительства</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйУчасток</name>
  </enumValues>
</mdclass:Enum>

Картотека1/src/Enums/трс_ВидОбъекта/трс_ВидОбъекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>трс_ВидОбъекта</name>
  <enumValues>
    <name>ЗемельныйУчасток</name>
  </enumValues>
  <enumValues>
    <name>ЧастьЗемельногоУчастка</name>
  </enumValues>
  <enumValues>
    <name>Здание</name>
  </enumValues>
  <enumValues>
    <name>Сооружение</name>
  </enumValues>
  <enumValues>
    <name>Помещение</name>
  </enumValues>
  <enumValues>
    <name>Квартира</name>
  </enumValues>
  <enumValues>
    <name>ОбъектНезавершенногоСтроительства</name>
  </enumValues>
  <enumValues>
    <name>Иное</name>
  </enumValues>
</mdclass:Enum>

Картотека1/src/Enums/трс_ВидПрава/трс_ВидПрава.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>трс_ВидПрава</name>
  <enumValues>
    <name>Собственность</name>
  </enumValues>
  <enumValues>
    <name>ДолеваяСобственность</name>
  </enumValues>
  <enumValues>
    <name>Аренда</name>
  </enumValues>
  <enumValues>
    <name>Субаренда</name>
  </enumValues>
  <enumValues>
    <name>Сервитут</name>
  </enumValues>
  <enumValues>
    <name>Ипотека</name>
  </enumValues>
  <enumValues>
    <name>Иное</name>
  </enumValues>
</mdclass:Enum>

Картотека1/src/Catalogs/трс_СвидетельствоНаПравоСобственности/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаполнитьНаименование();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АктивацияАренды();
	АктивацияПоТипу();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
&НаКлиенте
Процедура ВидОбъектаПриИзменении(Элемент)
	ОпределитьТипНедвижимости();
	АктивацияПоТипу();
КонецПроцедуры

&НаКлиенте
Процедура ВидПраваПриИзменении(Элемент)
	АктивацияАренды();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаименование()
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = трс_ОперацииНедвижимости.ЗаполнитьНаименование("Свидетельство на право собственности на ", Объект.НаименованиеОбъектаНедвижимости, Объект.трс_ДатаВыдачи);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура АктивацияПоТипу()

	ОКС = Перечисления.трс_ТипНедвижимости.ОбъектКапитальногоСтроительства;
	ЕстьОКС = Ложь;
	Если Объект.ТипНедвижимости = ОКС Тогда
		ЕстьОКС = Истина;
	Иначе
		ЕстьОКС = Ложь;
	КонецЕсли;   
	ЕстьЗУ = НЕ ЕстьОКС; 
		
	Элементы.ИспользованиеЗдания.Видимость = ЕстьОКС;
	Элементы.ЦелевоеИспользование.Видимость = ЕстьОКС;
	Элементы.Назначение.Видимость = ЕстьОКС;
	Элементы.Этажность.Видимость = ЕстьОКС;
	
	Если ЕстьОКС Тогда
		Объект.КатегорияЗемель = Неопределено;
	Иначе
		Объект.ИспользованиеЗдания = Неопределено;
		Объект.ЦелевоеИспользование = Неопределено;
		Объект.Назначение = Неопределено;
		Объект.Этажность = Неопределено;
	КонецЕсли;

	Элементы.КатегорияЗемель.Видимость = ЕстьЗУ;

КонецПроцедуры // АктивацияПоТипу()

&НаСервере
Процедура ОпределитьТипНедвижимости()
	
	ВозможныеВидыОбъекта = Перечисления.трс_ВидОбъекта;

	Если ЗначениеЗаполнено(Объект.ВидОбъекта) Тогда
		Если Объект.ВидОбъекта = ВозможныеВидыОбъекта.ЗемельныйУчасток или Объект.ВидОбъекта = ВозможныеВидыОбъекта.ЧастьЗемельногоУчастка Тогда
			Объект.ТипНедвижимости = Перечисления.трс_ТипНедвижимости.ЗемельныйУчасток;
		Иначе
			Объект.ТипНедвижимости = Перечисления.трс_ТипНедвижимости.ОбъектКапитальногоСтроительства;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ОпределитьТипНедвижимости()

&НаСервере
Процедура АктивацияАренды()

	Аренда = Перечисления.трс_ВидПрава.Аренда;
	Субаренда = Перечисления.трс_ВидПрава.Субаренда;
	Если Объект.ВидПрава = Аренда ИЛИ Объект.ВидПрава = Субаренда Тогда
		Элементы.КонецАренды.Видимость = Истина;
	Иначе
		Элементы.КонецАренды.Видимость = Ложь;
		Объект.КонецАренды = Неопределено;
	КонецЕсли;

КонецПроцедуры // АктивацияАренды()

#КонецОбласти
